clear all; 
close all; clc; % remises à zéro de précaution

m = 0.65;
Ix=7.5*10^(-3);
Iy=7.5*10^(-3);
Iz=1.3*10^(-2);
b=3.13*10^(-5);
d=7.5*10^(-7);
Rrad=0.15;
c=0.04;
theta0=0.26;
thetatw=0.045;
J=6*10^(-5);
l=0.23;

A=[0 0 0 1 0 0;
    0 0 0 0 1 0;
    0 0 0 0 0 1;
    0 0 0 0 0 0;
    0 0 0 0 0 0;
    0 0 0 0 0 0];

B=[0 0 0 0;
    0 0 0 0;
    0 0 0 0;
    0 -l/Ix 0 l/Ix;
    -l/Iy 0 l/Iy 0;
    -d/(b*Iz) d/(b*Iz) -d/(b*Iz) d/(b*Iz)];

poles = [-0.01-0.01j, -0.01+0.01j, -0.01-0.01j, -0.01+0.01j, -0.1, -0.05];

K=place(A,B,poles);

